###実装メモ
##蝶ネクタイ型変声機
#村人の好感度を上げる程度の能力。どうなるかって言うと、安く売り買いできるはず。
#英雄のステータスを付与するしかなさそうだ。

##キック力増強シューズ
#シフト離した瞬間に前方に爆発を起こす程度の能力

##犯人追跡メガネ
#敵を光らせる以外に用途が思い当たらない。あと暗視?

##腕時計型麻酔銃
#麻酔針を装填して麻酔銃で発射するとコマンドですごい効果が付与される仕組み。
#この仕組みだと普通のクロスボウで麻酔銃を持った人を打ったときに麻酔銃を持った人が眠ってしまう可能性がある。
#OPTIFINEのCITで特定のLoreのクロスボウだけ見た目を変えてます。
#なぜLoreで判別しているのかというと、腕時計に名前をつけて愛でる変人が現れてもクレームを入れられないためです。
#ちなみにLoreは1セクションでも一致していたらセレクタで検知できるらしいです。
#オフハンドでも問題なくハズ。

##ターボエンジン付きスケートボードについて
#第一段階は普通のスケボー。MGS2のスケボーBGMを思い出した。豚くらい。
#第二段階はソーラースケボー。夜は走れん。あと遅い。馬くらい。
#第三段界はターボエンジンスケボー。いつでも走れるけど石炭の補給が必要。かまどトロッコ。

##個人用移動ロケット
#いわゆるジェットパック。多分YのMotionいじって炎のエフェクトつけときゃいいやろ



###Lores
##Voice-Changing Bowtie
#これぞ蝶ネクタイ型変声機や！裏についとるダイヤルを回せば、いろいろな声が出せる。
##Power-Enhancing Kick Shoes
#ほーら！いいもの作っといたぞ！キック力増強シューズじゃ。このシューズで犯人をければひとたまりもないぞ！
##Criminal Tracking Glasses
#ほーれ完成したぞ！わしが発明した犯人追跡メガネじゃ。横のボタンを押してみぃ！
##Stun-Gun Wristwatch
#これは時計型麻酔銃といってな、至近距離にいる相手を瞬時に眠らせる事ができるんじゃ。
##Tranquilizer Dart
#象でも30分は眠る麻酔を固めた針。時計型麻酔銃で発射できる。
##Microphone
#そうだ！博士につけてもらった盗聴器で！このダイヤルで周波数を合わせれば特殊な音波が鼓膜を刺激して、メガネをかけたままでも聞ける。
#Detective Boys Badge
#何度見てもかっこいいですよね！少年探偵団のイニシャルデザインして、トランシーバー機能付き！
##Portable Bento Box Fax
#何が新開発だ。弁当箱に市販のFAXを取り付けただけじゃねぇか。
##Turbo Engine Skateboard
#博士からもらったこのスケボーは、一味違うぜ。
#高性能のターボエンジン搭載じゃ！ただしソーラーパワーじゃからのう。 日の出ているときしか使えないがのう。
##Anywhere Ball Dispensing Belt
#シューズと組み合わせて使うというか一体でいいじゃん。靴+エメ32=ベルト?
##Prototype mobile rocket
#で？今度は何を実験してたわけ？
#おう、やはり気になるか。しょうがないなぁ。
#そこまで言うなら教えてやろう。じゃーん！個人用移動ロケットじゃーん。
#こいつが完成すれば、交通渋滞は解消され、ワシは大金持ち！事故もなくなり、ワシは大金持ち！
##Drone
#ありきたりなどろーん。要は空飛べてスペクテイターカメラで映像を見れるチェストトロッコ
##Hang Glider Cape
#怪盗キッドのハンググライダーになるケープ。要はエリトラだな。
#なんとかして花火いらずにならないだろうか
#トランプ銃
#要は紙が玉の銃
